Ran Plan for dir: `webserver-cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...
aws_security_group.instance: Refreshing state... [id=sg-0c1ef2ad3f1a4073f]
aws_security_group.alb: Refreshing state... [id=sg-0c9a1eabd21a10568]
aws_launch_configuration.example: Refreshing state... [id=terraform-20210113020748497200000001]
aws_lb_target_group.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cf1e6658a2b56dfc]
aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:loadbalancer/app/terraform-asg-example/344aed0d0d4d4e2e]
aws_autoscaling_group.example: Refreshing state... [id=tf-asg-20210113013334645500000002]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:listener/app/terraform-asg-example/344aed0d0d4d4e2e/53fa7e31529393d2]
aws_lb_listener_rule.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:listener-rule/app/terraform-asg-example/344aed0d0d4d4e2e/53fa7e31529393d2/46eb3169ab514c16]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.example will be updated in-place
~ resource "aws_autoscaling_group" "example" {
        id                        = "tf-asg-20210113013334645500000002"
      ~ launch_configuration      = "terraform-20210113020748497200000001" -> (known after apply)
        name                      = "tf-asg-20210113013334645500000002"
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.example must be replaced
+/- resource "aws_launch_configuration" "example" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:869946923544:launchConfiguration:ebfd8f48-28eb-4299-a3ab-262fd480c82f:launchConfigurationName/terraform-20210113020748497200000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20210113020748497200000001" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "terraform-20210113020748497200000001" -> (known after apply)
      ~ user_data                        = "5b70481cb3f58a6e591508fa0632a1322d663719" -> "39a401f3604ed212abae1ae2427abd925d39ef9b" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (5 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](https://ef1ed0cb3538.ngrok.io/lock?id=jonico%252Fatlantis-example%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d webserver-cluster`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
